sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/m0p/hw_factoryregion.h
/*****************************************************************************

  Copyright (C) 2023 Texas Instruments Incorporated - http://www.ti.com/

  Redistribution and use in source and binary forms, with or without
  modification, are permitted provided that the following conditions
  are met:

   Redistributions of source code must retain the above copyright
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_factoryregion__include
#define ti_devices_msp_peripherals_hw_factoryregion__include

/* This preliminary header file does not have a version number */
/* MMR repo: https://bitbucket.itg.ti.com/projects/cmcu_msp65soc/repos/trim_platform_constants */
/* MMR revision: ff4b6bcad5d93ca548bdb94b818a30dc3f4acd3f */
/* Generator revision: c98c4ac511e2bd0d918c5d427bd46b7a359dacf1
   (MInT: ec7ec7482a60c6871be32db8b378ec27aa4771f6) */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* FACTORYREGION Registers
******************************************************************************/
#define FACTORYREGION_OPEN_OFS                   ((uint32_t)0x41C40000U)


/** @addtogroup FACTORYREGION_OPEN
  @{
*/

typedef struct {
  __I  uint32_t TRACEID;                           /* !< (@ 0x41C40000) Defined by TI, during ATE, based on wafer */
  __I  uint32_t DEVICEID;                          /* !< (@ 0x41C40004) This is the JTAGIDCODE that comes from the Ramp
                                                      system */
  __I  uint32_t USERID;                            /* !< (@ 0x41C40008) Defined by TI, depending on device spin */
  __I  uint32_t BSLPIN_UART;                       /* !< (@ 0x41C4000C) BSL UART Pin Configuration */
  __I  uint32_t BSLPIN_I2C;                        /* !< (@ 0x41C40010) BSL I2C Pin Configuration */
  __I  uint32_t BSLPIN_INVOKE;                     /* !< (@ 0x41C40014) BSL Pin Invocation Configuration */
  __I  uint32_t SRAMFLASH;                         /* !< (@ 0x41C40018) */
  __I  uint32_t PLLSTARTUP0_4_8MHZ;                /* !< (@ 0x41C4001C) */
  __I  uint32_t PLLSTARTUP1_4_8MHZ;                /* !< (@ 0x41C40020) System PLL Paramater 1 MMR --- Data from Flash
                                                      Table Lookup */
  __I  uint32_t PLLSTARTUP0_8_16MHZ;               /* !< (@ 0x41C40024) */
  __I  uint32_t PLLSTARTUP1_8_16MHZ;               /* !< (@ 0x41C40028) System PLL Paramater 1 MMR --- Data from Flash
                                                      Table Lookup */
  __I  uint32_t PLLSTARTUP0_16_32MHZ;              /* !< (@ 0x41C4002C) */
  __I  uint32_t PLLSTARTUP1_16_32MHZ;              /* !< (@ 0x41C40030) System PLL Paramater 1 MMR --- Data from Flash
                                                      Table Lookup */
  __I  uint32_t PLLSTARTUP0_32_48MHZ;              /* !< (@ 0x41C40034) */
  __I  uint32_t PLLSTARTUP1_32_48MHZ;              /* !< (@ 0x41C40038) System PLL Paramater 1 MMR --- Data from Flash
                                                      Table Lookup */
  __I  uint32_t TEMP_SENSE0;                       /* !< (@ 0x41C4003C) Temperature sensor room temperature calibration
                                                      code. This is ADC conversion results of temperature sensor output
                                                      voltage.  Included in BOOTCRC calculation. */
  __I  uint32_t RESERVED0;                         /* !< (@ 0x41C40040) */
  __I  uint32_t RESERVED1;                         /* !< (@ 0x41C40044) */
  __I  uint32_t RESERVED2;                         /* !< (@ 0x41C40048) */
  __I  uint32_t RESERVED3;                         /* !< (@ 0x41C4004C) */
  __I  uint32_t RESERVED4;                         /* !< (@ 0x41C40050) */
  __I  uint32_t RESERVED5;                         /* !< (@ 0x41C40054) */
  __I  uint32_t RESERVED6;                         /* !< (@ 0x41C40058) */
  __I  uint32_t RESERVED7;                         /* !< (@ 0x41C4005C) */
  __I  uint32_t RESERVED8;                         /* !< (@ 0x41C40060) */
  __I  uint32_t RESERVED9;                         /* !< (@ 0x41C40064) */
  __I  uint32_t RESERVED10;                        /* !< (@ 0x41C40068) */
  __I  uint32_t RESERVED11;                        /* !< (@ 0x41C4006C) */
  __I  uint32_t RESERVED12;                        /* !< (@ 0x41C40070) */
  __I  uint32_t RESERVED13;                        /* !< (@ 0x41C40074) */
  __I  uint32_t RESERVED14;                        /* !< (@ 0x41C40078) */
  __I  uint32_t BOOTCRC;                           /* !< (@ 0x41C4007C) BOOTCRC records the 32-bit CRC of all locations in
                                                      OPEN including reserved locations. */
} FACTORYREGION_OPEN_Regs;

/*@}*/ /* end of group FACTORYREGION_OPEN */

